# Local Variables:
# eval: (add-hook 'after-save-hook #'org-babel-execute-buffer t t)
# End:
* A Twitter Like Rails Application
** Introduction
   - This is one of my personal ruby on rails perject
   - The purpose is to continually adding more functions to it as learning more
     cool stuff
   - A sample project already deployed to Heroku, please refer to
     [[https://leslie-twitter-like-app.herokuapp.com/][Heroku App]]

** Current Implemented Functions
   - user account registration and activated via email (AWS SES)
   - user reset password
   - user follow and unfollow other users
   - micropost content text search (by applying searchkick, elasticsearch)
   - view_component render for html and json response

** Todo Functions
   - Adding comment function to the post
   - Applying ActionText for rich text content
   - Realtime notification when a friend of the user make a new post or comment
     on the post
   - Integrate Graph Database Neo4j or Tinkerpop for further user relations and
     interactions analysis, one tiny issue comes to Neo4j is that ActiveGraph
     gem is based on neo4j-ruby-driver gem, neo4j-ruby-driver gem relies on
     libseabolt.so, which is a c++ project and requires to download and compile
     with cmake, while I can compile it on my laptop, on Heroku runtime it is a
     read-only container, neither yet figure out a way to compile it on Heroku
     container or just upload the dynamic library into it, luckily, seems like
     Heroku also support docker-compose project, will give that a try in future

** Test

*** Execute All Tests
#+begin_src shell :exports both
  bin/rails t
#+end_src

#+RESULTS:
| Started   | with   | run                                                                  | options     | --seed |     25762 |   |         |   |       |
|           |        |                                                                      |             |        |           |   |         |   |       |
|           |        |                                                                      |             |        |           |   |         |   |       |
| Progress: |        | ==================================================================== |             |        |           |   |         |   |       |
|           |        |                                                                      |             |        |           |   |         |   |       |
| Finished  | in     | 1.51731s                                                             |             |        |           |   |         |   |       |
| 66        | tests, | 337                                                                  | assertions, |      0 | failures, | 0 | errors, | 0 | skips |

*** Execute Tests For Models

#+begin_src shell :exports both
  bin/rails test:models
#+end_src

#+RESULTS:
| WARNING:  |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| Stimulus  | Reflex    | requires                                                             | caching     | to           | be        | enabled.     | Caching | allows | the   | session | to | be | modified | during | ActionCable | requests. |
| To        | enable    | caching                                                              | in          | development, | run:      |              |         |        |       |         |    |    |          |        |             |           |
| rails     | dev:cache |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| WARNING:  |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| Stimulus  | Reflex    | requires                                                             | caching     | to           | be        | enabled.     | Caching | allows | the   | session | to | be | modified | during | ActionCable | requests. |
| But       | your      | config.cache_store                                                   | is          | set          | to        | :null_store, | so      | it     | won't | work.   |    |    |          |        |             |           |
| Started   | with      | run                                                                  | options     | --seed       | 63421     |              |         |        |       |         |    |    |          |        |             |           |
|           |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
|           |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| Progress: |           | ==================================================================== |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
|           |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| Finished  | in        | 0.60797s                                                             |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| 19        | tests,    | 63                                                                   | assertions, | 0            | failures, | 0            | errors, | 0      | skips |         |    |    |          |        |             |           |

*** Execute Tests For Integration
#+begin_src  shell :exports both
  bin/rails test:integration
#+end_src

#+RESULTS:
| WARNING:  |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| Stimulus  | Reflex    | requires                                                             | caching     | to           | be        | enabled.     | Caching | allows | the   | session | to | be | modified | during | ActionCable | requests. |
| To        | enable    | caching                                                              | in          | development, | run:      |              |         |        |       |         |    |    |          |        |             |           |
| rails     | dev:cache |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| WARNING:  |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| Stimulus  | Reflex    | requires                                                             | caching     | to           | be        | enabled.     | Caching | allows | the   | session | to | be | modified | during | ActionCable | requests. |
| But       | your      | config.cache_store                                                   | is          | set          | to        | :null_store, | so      | it     | won't | work.   |    |    |          |        |             |           |
| Started   | with      | run                                                                  | options     | --seed       | 54168     |              |         |        |       |         |    |    |          |        |             |           |
|           |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
|           |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| Progress: |           | ==================================================================== |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
|           |           |                                                                      |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| Finished  | in        | 1.31036s                                                             |             |              |           |              |         |        |       |         |    |    |          |        |             |           |
| 20        | tests,    | 222                                                                  | assertions, | 0            | failures, | 0            | errors, | 0      | skips |         |    |    |          |        |             |           |
